"use client";

import {
    staffDownsizingSchema,
    StaffDownsizingValues,
    STAFF_DOWNSIZING_DEPARTMENT_OPTIONS,
    STAFF_DOWNSIZING_BRANCH_OPTIONS,
} from "@/validations/StaffDownsizing";
import { SelectField } from "../invoice/SelectField";
import { InvoiceTextField } from "../invoice/TextField";
import { FormSection } from "../invoice/FormSection";
import { zodResolver } from "@hookform/resolvers/zod";
import { Controller, useForm } from "react-hook-form";
import MainButton from "../MainButton";
import { Check } from "lucide-react";
import { Button } from "@/components/ui/button";
import SecondaryButton from "../SecondaryButton";

const StaffDownsizing = () => {

    const {
        control,
        register,
        handleSubmit,
        formState: { errors },
    } = useForm<StaffDownsizingValues>({
        resolver: zodResolver(staffDownsizingSchema),
        defaultValues: {
            searchName: "",
            department: "",
            branch: "",
        },
    });

    return (
        <form className="rounded-2xl ctm-shadow bg-white p-5 space-y-5" >
            <div className="flex items-center gap-3" >
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M11.5576 1.25C13.7479 1.24999 15.4683 1.25012 16.8115 1.43066C18.1882 1.61575 19.2805 2.00313 20.1387 2.86133C20.9969 3.71953 21.3842 4.81182 21.5693 6.18848C21.7499 7.53174 21.75 9.25212 21.75 11.4424V11.5576C21.75 13.7479 21.7499 15.4683 21.5693 16.8115C21.3842 18.1882 20.9969 19.2805 20.1387 20.1387C19.2805 20.9969 18.1882 21.3842 16.8115 21.5693C15.4683 21.7499 13.7479 21.75 11.5576 21.75H11.4424C9.25212 21.75 7.53174 21.7499 6.18848 21.5693C4.81182 21.3842 3.71953 20.9969 2.86133 20.1387C2.00313 19.2805 1.61575 18.1882 1.43066 16.8115C1.25012 15.4683 1.24999 13.7479 1.25 11.5576V11.4424C1.24999 9.25212 1.25012 7.53174 1.43066 6.18848C1.61575 4.81182 2.00313 3.71953 2.86133 2.86133C3.71953 2.00313 4.81182 1.61575 6.18848 1.43066C7.53174 1.25012 9.25212 1.24999 11.4424 1.25H11.5576ZM11.5 2.75C9.23962 2.75 7.61959 2.75137 6.38769 2.91699C5.17747 3.07972 4.45489 3.38885 3.92187 3.92187C3.38885 4.45489 3.07972 5.17747 2.91699 6.38769C2.75137 7.61959 2.75 9.23962 2.75 11.5C2.75 13.7604 2.75137 15.3804 2.91699 16.6123C3.07972 17.8225 3.38885 18.5451 3.92187 19.0781C4.45489 19.6111 5.17747 19.9203 6.38769 20.083C7.61959 20.2486 9.23962 20.25 11.5 20.25C13.7604 20.25 15.3804 20.2486 16.6123 20.083C17.8225 19.9203 18.5451 19.6111 19.0781 19.0781C19.6111 18.5451 19.9203 17.8225 20.083 16.6123C20.2486 15.3804 20.25 13.7604 20.25 11.5C20.25 9.23962 20.2486 7.61959 20.083 6.38769C19.9203 5.17747 19.6111 4.45489 19.0781 3.92187C18.5451 3.38885 17.8225 3.07972 16.6123 2.91699C15.3804 2.75137 13.7604 2.75 11.5 2.75ZM13.5 14.25C13.9142 14.25 14.25 14.5858 14.25 15C14.25 15.4142 13.9142 15.75 13.5 15.75H9.5C9.08579 15.75 8.75 15.4142 8.75 15C8.75 14.5858 9.08579 14.25 9.5 14.25H13.5ZM14.5 10.75C14.9142 10.75 15.25 11.0858 15.25 11.5C15.25 11.9142 14.9142 12.25 14.5 12.25L8.5 12.25C8.08579 12.25 7.75 11.9142 7.75 11.5C7.75 11.0858 8.08579 10.75 8.5 10.75L14.5 10.75ZM15.5 7.25C15.9142 7.25 16.25 7.58579 16.25 8C16.25 8.41421 15.9142 8.75 15.5 8.75H7.5C7.08579 8.75 6.75 8.41421 6.75 8C6.75 7.58579 7.08579 7.25 7.5 7.25H15.5Z" fill="#161616" />
                </svg>
                <p className="text-[#0F1219] text-[22px] font-bold" >  تصفية الموظفين   </p>

            </div>

            <FormSection title="" gridClassName="!grid-cols-1 md:!grid-cols-2 lg:!grid-cols-3">
                <InvoiceTextField
                    label="بحث"
                    placeholder=" ابحث بالاسم "
                    {...register("searchName")}
                />

                <Controller
                    control={control}
                    name="department"
                    render={({ field }) => (
                        <SelectField
                            label="القسم"
                            placeholder=" جميع الاقسام "
                            value={field.value as string}
                            onChange={field.onChange}
                            options={STAFF_DOWNSIZING_DEPARTMENT_OPTIONS}
                            error={errors.department?.message}
                        />
                    )}
                />
                <Controller
                    control={control}
                    name="branch"
                    render={({ field }) => (
                        <SelectField
                            label="الفرع"
                            placeholder=" جميع الفروع "
                            value={field.value as string}
                            onChange={field.onChange}
                            options={STAFF_DOWNSIZING_BRANCH_OPTIONS}
                            error={errors.branch?.message}
                        />
                    )}
                />


            </FormSection>

            <div className="flex flex-col md:flex-row gap-3 justify-end" >

                <SecondaryButton text="إعادة تعيين" icon={<svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fillRule="evenodd" clipRule="evenodd" d="M4.86305 2.03215C5.00638 1.68055 5.40761 1.51172 5.75921 1.65506L8.50921 2.77615C8.85055 2.91531 9.0214 3.2989 8.89651 3.64571L7.97985 6.19128C7.8512 6.54852 7.45732 6.73383 7.10008 6.60519C6.74284 6.47655 6.55753 6.08266 6.68617 5.72542L7.12959 4.49406C4.42035 5.64443 2.52051 8.33015 2.52051 11.4584C2.52051 11.8886 2.55636 12.3099 2.6251 12.7196C2.68792 13.0941 2.43529 13.4486 2.06083 13.5114C1.68636 13.5742 1.33187 13.3216 1.26905 12.9471C1.18775 12.4625 1.14551 11.9651 1.14551 11.4584C1.14551 7.87464 3.25427 4.78462 6.29823 3.35967L5.24014 2.92832C4.88854 2.78498 4.71971 2.38375 4.86305 2.03215ZM10.78 3.20867C10.8428 2.83421 11.1973 2.58157 11.5718 2.6444C15.7993 3.35364 19.0205 7.02914 19.0205 11.4584C19.0205 12.1184 18.9489 12.7621 18.8128 13.3819L19.7792 12.7235C20.093 12.5097 20.5207 12.5908 20.7345 12.9046C20.9483 13.2184 20.8672 13.6461 20.5534 13.8599L17.8625 15.6932C17.7003 15.8037 17.4985 15.8396 17.308 15.7918C17.1176 15.744 16.9567 15.617 16.8659 15.4429L15.4318 12.6929C15.2562 12.3562 15.3868 11.941 15.7234 11.7654C16.0601 11.5899 16.4754 11.7205 16.6509 12.0571L17.3795 13.4543C17.5529 12.8188 17.6455 12.1497 17.6455 11.4584C17.6455 7.71182 14.9204 4.60041 11.3443 4.00044C10.9698 3.93762 10.7172 3.58313 10.78 3.20867ZM2.53476 16.0417C2.53476 15.662 2.84257 15.3542 3.22226 15.3542H6.41634C6.79604 15.3542 7.10384 15.662 7.10384 16.0417C7.10384 16.4214 6.79604 16.7292 6.41634 16.7292H4.65984C6.03452 18.1434 7.95639 19.0209 10.083 19.0209C12.0203 19.0209 13.7861 18.2933 15.1245 17.0954C15.4074 16.8421 15.8421 16.8662 16.0953 17.1491C16.3485 17.4321 16.3244 17.8667 16.0415 18.1199C14.4608 19.5347 12.3716 20.3959 10.083 20.3959C7.68827 20.3959 5.51375 19.4537 3.90976 17.9212V19.25C3.90976 19.6297 3.60196 19.9375 3.22226 19.9375C2.84257 19.9375 2.53476 19.6297 2.53476 19.25L2.53476 16.0417Z" fill="#161616" />
                </svg>} className="!w-full md:!w-[165px]" />
                <MainButton text="تطبيق" icon={<Check className="w-5 h-5" />} className="!w-full md:!w-[130px]" />
            </div>
        </form>
    )
}

export default StaffDownsizing